

{
    "room_types": [
        {
            "type": "Single Room",
            "description": "A cozy room designed for one person, featuring a comfortable single bed, suitable for solo travelers seeking comfort and privacy.",
            "image_url": "../../data/images/rooms/single.webp"
      },
      {
        "type": "Double Room",
        "description": "A spacious room accommodating two guests, equipped with either one double bed or two twin beds, ideal for couples or friends sharing a room.",
        "image_url": "../../data/images/rooms/double.webp"

      },
      {
        "type": "Triple Room",
        "description": "Designed to comfortably accommodate three guests, this room offers a combination of beds, such as a double bed and a single bed, or three single beds.",
        "image_url": "../../data/images/rooms/triple.webp"

      },
      {
        "type": "Queen Room",
        "description": "A room featuring a queen-sized bed, suitable for up to two guests, offering a balance of space and comfort.",
        "image_url": "../../data/images/rooms/queen.webp"

      },
      {
        "type": "King Room",
        "description": "A luxurious room equipped with a king-sized bed, providing ample space and comfort for up to two guests.",
        "image_url": "../../data/images/rooms/king.webp"

      },
      {
        "type": "Twin Room",
        "description": "Featuring two separate twin beds, this room is perfect for guests who prefer individual sleeping arrangements.",
        "image_url": "../../data/images/rooms/twin.webp"
      },
      {
        "type": "Double-Double Room",
        "description": "Equipped with two double beds, this room accommodates up to four guests, making it ideal for families.",
        "image_url": "../../data/images/rooms/double-double.webp"

      },
      {
        "type": "Studio Room",
        "description": "A multifunctional space featuring a studio bed (a couch that converts into a bed) and may include additional amenities like a kitchenette.",
        "image_url": "../../data/images/rooms/studio.webp"

      },
      {
        "type": "Suite",
        "description": "An elegant suite offering separate living and sleeping areas, providing ample space and luxury for guests seeking an upgraded experience.",
        "image_url": "../../data/images/rooms/suite.webp"

      },
      {
        "type": "Junior Suite",
        "description": "A smaller suite with a combined living and sleeping area, offering a taste of luxury and extra space.",
        "image_url": "../../data/images/rooms/junior-suite.webp"

      },
      {
        "type": "Master Suite",
        "description": "A spacious suite featuring multiple rooms, including separate living and sleeping areas, designed for guests seeking premium comfort.",
        "image_url": "../../data/images/rooms/master-suite.webp"

      },
      {
        "type": "Executive Suite",
        "description": "Designed for business travelers, this suite offers a dedicated workspace, meeting area, and luxurious sleeping quarters.",
        "image_url": "../../data/images/rooms/executive-suite.webp"

      },
      {
        "type": "Presidential Suite",
        "description": "The most luxurious accommodation in the hotel, featuring expansive space, premium amenities, and exclusive services.",
        "image_url": "../../data/images/rooms/presidential-suite.webp"

      },
      {
        "type": "Penthouse Suite",
        "description": "A luxurious top-floor suite featuring premium amenities, expansive views, and exclusive services for an unparalleled stay.",
        "image_url": "../../data/images/rooms/penthouse-suite.webp"

      },
      {
        "type": "Villa",
        "description": "A standalone accommodation offering multiple rooms, private amenities like a pool or garden, ideal for families or groups seeking privacy.",
        "image_url": "../../data/images/rooms/villa.webp"
      },
      {
        "type": "Connecting Rooms",
        "description": "Two rooms connected by a private door, allowing easy access between rooms, perfect for families or groups.",
        "image_url": "../../data/images/rooms/connecting.webp"
      },
      {
        "type": "Accessible Room",
        "description": "Designed for guests with disabilities, this room offers accessible features like wider doorways, grab bars, and modified bathroom facilities.",
        "image_url": "../../data/images/rooms/accissible.webp"
      },
      {
        "type": "Cabana",
        "description": "A room located near the pool or beach area, often featuring a private terrace, offering easy access to recreational facilities.",
        "image_url": "../../data/images/rooms/cabana.webp"
      },
      {
        "type": "Bungalow",
        "description": "A standalone, single-story accommodation, often found in resorts, providing a private and intimate setting.",
        "image_url": "../../data/images/rooms/Bungalow.webp"
      },
      {
        "type": "Loft",
        "description": "A modern, open-plan room with high ceilings, often featuring industrial design elements and ample natural light.",
        "image_url": "../../data/images/rooms/Loft.webp"
      }
    ]
  }
  